BSP/src/Documents/_КалендарныеПлатежи/_КалендарныеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_КалендарныеПлатежи</name>
  <comment>Месячные БДДС</comment>
  <registerRecords>AccumulationRegister._ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef._Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>ДатаПлатежа</name>
      <comment>Запланированная дата платежа</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef._Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef._ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef._СтаьтяДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКСогласованию</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef._Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BSP/src/AccumulationRegisters/_ДвиженияДенежныхСредств/_ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>_ДвиженияДенежныхСредств</name>
  <resources>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef._Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КалендарныйПлатеж</name>
    <type>
      <types>DocumentRef._КалендарныеПлатежи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef._СтаьтяДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef._ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BSP/src/Documents/_КалендарныеПлатежи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения._ДвиженияДенежныхСредств.Записывать = Истина;

	// регистр _Бюджет Приход
	Для Каждого ТекСтрокаПлатежи Из Платежи Цикл
		Движение = Движения._ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.КалендарныйПлатеж =Ссылка;
		Движение.Плательщик =Плательщик;
		Движение.Инициатор =ТекСтрокаПлатежи.Инициатор;
		Движение.ЦФО = ТекСтрокаПлатежи.ЦФО;
		Движение.СтатьяДДС = ТекСтрокаПлатежи.СтатьяДДС;
		Движение.СуммаПлатежа = ТекСтрокаПлатежи.СуммаПлатежа;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	
КонецПроцедуры
